pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_1=pd.read_csv('1.txt')

In [12]:
df_1

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4
2   3  NaN  3.0   4
3   4  NaN  NaN   4

In [5]:
df_2=pd.read_csv('2.txt')

In [6]:
df_2

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4
2   3  NaN  3.0   5

In [9]:
df_1.columns

Index(['C1', 'C2', 'C3', 'C4'], dtype='object')

In [10]:
df_2.columns

Index(['C1', 'C2', 'C3', 'C4'], dtype='object')

In [11]:
df_1.T

      0    1    2    3
C1  1.0  2.0  3.0  4.0
C2  2.0  2.0  NaN  NaN
C3  3.0  NaN  3.0  NaN
C4  4.0  4.0  4.0  4.0

In [29]:
df_1.merge(df_2[['C1','C2']],left_on='C1',right_on='C1',how='outer')

   C1  C2_x   C3  C4  C2_y
0   1   2.0  3.0   4   2.0
1   2   2.0  NaN   4   2.0
2   3   NaN  3.0   4   NaN
3   4   NaN  NaN   4   NaN

In [32]:
df_1

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4
2   3  NaN  3.0   4
3   4  NaN  NaN   4

In [35]:
f1=df_1.query('C1==1 or C2==2')
f2=df_2.query('C2==2')

In [36]:
f1

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4

In [37]:
f2

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4

In [41]:
f3=pd.merge(f1,f2[['C1','C2']],on='C1')[['C1','C2_y']]

In [42]:
f3

   C1  C2_y
0   1   2.0
1   2   2.0

In [47]:
f3.rename(columns={'C2_y':'C2'},inplace=True)

In [48]:
f3

   C1   C2
0   1  2.0
1   2  2.0

In [57]:
f5=f1.merge(f3,on='C1').rename(columns={'C2_y':'C2'})[['C1','C2','C3','C4']]

In [58]:
f6=df_1.query('C1==3 or C1==4')

In [59]:
f5

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4

In [60]:
f6

   C1  C2   C3  C4
2   3 NaN  3.0   4
3   4 NaN  NaN   4

In [62]:
f_concat=[f5,f6]

In [63]:
pd.concat(f_concat)

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4
2   3  NaN  3.0   4
3   4  NaN  NaN   4

In [65]:
df_1

   C1   C2   C3  C4
0   1  2.0  3.0   4
1   2  2.0  NaN   4
2   3  NaN  3.0   4
3   4  NaN  NaN   4

In [67]:
d1=pd.read_csv('3.txt')
d2=pd.read_csv('2.txt')

In [68]:
d1

   Payload qc
0        1  X
1        2  X
2        3  Y

In [69]:
d2

   Payload q_c_A q_c_B q_c_Tes
0        1     X     X    PASS
1        2     X     X    PASS
2        3     Y     X    FAIL

In [75]:
d1.merge(d2,on='Payload')[['Payload','qc','q_c_B','q_c_Tes']]

   Payload qc q_c_B q_c_Tes
0        1  X     X    PASS
1        2  X     X    PASS
2        3  Y     X    FAIL